# GetCurve Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLoad..::..GetCurve Method
LineLoad Class See Also
---
Returns curve that define geometry of the line load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Curve GetCurve()
```

Visual Basic
---
```text
Public Function GetCurve As Curve
```

Visual C++
---
```text
public:
Curve^ GetCurve()
```

# See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace